
# State **`s3://infrahouse-aws-control-303467602807/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |   🔴 Destroy |
|----------:|---------:|------------:|-------------:|
|        ✅ |        6 |           2 |            6 |
## Affected resources by action

|  Action  | Resources                                                                     |
|:--------:|:------------------------------------------------------------------------------|
|    🟡    | `module.actions-runner.module.record_metric.aws_lambda_function.lambda`       |
|    🟡    | `module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda` |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.actions-runner.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "record_metric_actions-runner-20250505203133108100000007-INx3ry"
      ~ last_modified                  = "2025-05-05T21:51:00.602+0000" -> (known after apply)
      ~ s3_key                         = "ca8c4283-59ba-1241-a9f3-75d742145f48.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126570200000001/ca8c4283-59ba-1241-a9f3-75d742145f48.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "741016f307cd9c76668ae0332caac476" -> (known after apply)
      ~ id                            = "ca8c4283-59ba-1241-a9f3-75d742145f48.zip" -> (known after apply)
      ~ key                           = "ca8c4283-59ba-1241-a9f3-75d742145f48.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner/modules/record_metric/ca8c4283-59ba-1241-a9f3-75d742145f48.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133108100000007-INx3ry"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "4842498796993619748" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "a502cf8854b179715a96efb141e4e72a" -> "d2d150575969dfe5ad34d9383f06a744"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "ca8c4283-59ba-1241-a9f3-75d742145f48" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "a502cf8854b179715a96efb141e4e72a" -> "d2d150575969dfe5ad34d9383f06a744"
            # (1 unchanged element hidden)
        }
      ~ result  = "ca8c4283-59ba-1241-a9f3-75d742145f48" -> (known after apply)
    }

  # module.actions-runner-noble.module.record_metric.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = ".terraform/modules/actions-runner-noble/modules/record_metric/lambda"
      + type                = "zip"
    }

  # module.actions-runner-noble.module.record_metric.aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "record_metric_actions-runner-20250505203133193000000009-KWX4No"
      ~ last_modified                  = "2025-05-05T21:51:00.594+0000" -> (known after apply)
      ~ s3_key                         = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip" -> (known after apply)
        tags                           = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.actions-runner-noble.module.record_metric.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      + acl                           = (known after apply)
      ~ arn                           = "arn:aws:s3:::infrahouse-action-runner-lambda-20250505203126845000000003/b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "741016f307cd9c76668ae0332caac476" -> (known after apply)
      ~ id                            = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip" -> (known after apply)
      ~ key                           = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = ".terraform/modules/actions-runner-noble/modules/record_metric/b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0.zip" -> (known after apply)
      ~ storage_class                 = "STANDARD" -> (known after apply)
        tags                          = {
            "account"           = "303467602807"
            "asg_name"          = "actions-runner-20250505203133193000000009-KWX4No"
            "created_by_module" = "infrahouse/actions-runner/aws"
            "environment"       = "development"
            "service"           = "actions-runner"
        }
      + version_id                    = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.actions-runner-noble.module.record_metric.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "2350946253031819747" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "dependencies_version" = "a502cf8854b179715a96efb141e4e72a" -> "d2d150575969dfe5ad34d9383f06a744"
            # (1 unchanged element hidden)
        }
    }

  # module.actions-runner-noble.module.record_metric.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "requirements.txt" = "a502cf8854b179715a96efb141e4e72a" -> "d2d150575969dfe5ad34d9383f06a744"
            # (1 unchanged element hidden)
        }
      ~ result  = "b5bc54d1-fc40-b559-fa72-99ee4b1b7ad0" -> (known after apply)
    }

Plan: 6 to add, 2 to change, 6 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtMzAzNDY3NjAyODA3L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDYsICJjaGFuZ2UiOiAyLCAiZGVzdHJveSI6IDZ9fQ==
```
</details>